In [2]:
import numpy as np
import pandas as pd

In [2]:
data_one = { 'A' : ['A0','A1','A2','A3'], 'B': ['B0','B1','B2','B3']}

In [3]:
data_two = { 'C' : ['C0','C1','C2','C3'], 'D': ['D0','D1','D2','D3']}

In [10]:
one = pd.DataFrame(data_one)

In [11]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [12]:
two = pd.DataFrame(data_two)

In [13]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [17]:
pd.concat([one,two], axis=1) #concatenating by columns

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [18]:
pd.concat([one,two], axis=0) #concatenating by rows

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [20]:
two.columns = one.columns

In [21]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [24]:
pd.concat([one,two], axis=0) #concatenating by rows

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [3]:
reg_data = { 'reg_id':[1,2,3,4],'name' : ['A0','A1','A2','A3']}
log_data = {'log_id':[1,2,3,4], 'name' : ['C0','A1','C2','A2']}

In [4]:
registeration = pd.DataFrame(reg_data)

In [5]:
registeration

   reg_id name
0       1   A0
1       2   A1
2       3   A2
3       4   A3

In [6]:
login = pd.DataFrame(log_data)

In [7]:
login

   log_id name
0       1   C0
1       2   A1
2       3   C2
3       4   A2

In [20]:
pd.merge(registeration,login,how='inner',on='name') #inner join/merge only same vales in bith tables

   reg_id name  log_id
0       2   A1       2
1       3   A2       4

In [21]:
pd.merge(left=registeration,right=login,how='left',on='name') #left join

   reg_id name  log_id
0       1   A0     NaN
1       2   A1     2.0
2       3   A2     4.0
3       4   A3     NaN

In [22]:
pd.merge(left=registeration,right=login,how='right',on='name') #right join

   reg_id name  log_id
0     NaN   C0       1
1     2.0   A1       2
2     NaN   C2       3
3     3.0   A2       4

In [23]:
pd.merge(left=registeration,right=login,how='outer',on='name') #outer join where we get all values

   reg_id name  log_id
0     1.0   A0     NaN
1     2.0   A1     2.0
2     3.0   A2     4.0
3     4.0   A3     NaN
4     NaN   C0     1.0
5     NaN   C2     3.0

In [26]:
registeration.columns = ['reg_id','reg_name']

In [27]:
registeration

   reg_id reg_name
0       1       A0
1       2       A1
2       3       A2
3       4       A3

In [28]:
login

   log_id name
0       1   C0
1       2   A1
2       3   C2
3       4   A2

In [32]:
results = pd.merge(registeration,login,how='inner',left_on="reg_name",right_on="name")

In [33]:
results

   reg_id reg_name  log_id name
0       2       A1       2   A1
1       3       A2       4   A2

In [36]:
results.drop('reg_name',axis=1) #dropping the reg_name column from result

   reg_id  log_id name
0       2       2   A1
1       3       4   A2